Repository: common-repository/commfort-webchat
Catalog: translations/cf_webchat-*.po
Languages: ru_ru

source: Chat URL
ru_ru: Ссылка на страницу с чатом

source: Enter the URL, where the chat would be located. Do not include base root (http://sait_name/)! Examples: chat, node/1...
ru_ru: Введите путь к странице, где будет расположен чат. Ссылка не должна содержать базовый путь к сайту(http://sait_name/)! Примеры: chat, node/1...

source: Show users IP's
ru_ru: Показывать IP адреса

source: Check, if IPs must be shown in users block
ru_ru: Отметьте, если в списке пользователей надо показывать IP каждого пользователя

source: Enable smilies
ru_ru: Включить смайлы

source: Smilies have to be located at path - "!foldername". File "!filename" must have encoding UTF8
ru_ru: Смайлы должны быть расположены в папке - "!foldername". Файл "!filename" должен иметь кодировку UTF8

source: Enable sound notification
ru_ru: Включить звуковое оповещение

source: Check, to enable sound notification by default. The sound will be played on each chat event
ru_ru: Отметьте, чтобы включить звуковое оповещение по умолчанию. При возникновении события в чате будет проиграна мелодия оповещения

source: Enable checking ping from plugin
ru_ru: Включить проверку соединения с плагином

source: Check, to enable checking ping from plugin, to determine connection state between plugin and webchat (webchat users will see tips, if connection problems appeared). When connection state would set to unactive - all webchat talking will be only among webchat users. Time between machine, where plugin placed and machine, where webchat works, must be strongly SYNCHRONIZED
ru_ru: Отметьте, чтобы включить проверку соединения с чатом, которая определяет состояние соединения с плагином (пользователи вебчата увидят предупреждение, если возникнут проблемы с соединением). Если соединение с плагином полностью оборвется - то все общение будет идти только между пользователями вебчата. Время на машине, где установлен плагин, и на машине, где установлен вебчат, должно быть строго СИНХРОНИЗИРОВАННО

source: Optimize smilies
ru_ru: Оптимизировать смайлы

source: Smilies successfully optimized
ru_ru: Смайлы успешно оптимизированы

source: Smilies file does not exist. Please, locate file "smilies_serv.txt" in folder "@foldername"
ru_ru: Файл смайлов не существует. Пожалуйста, разместите файл "smilies_serv.txt" в папке "@foldername"

source: Path module was enabled
ru_ru: Модуль Path был включен

source: Chat will be based here
ru_ru: Здесь будет расположен чат

source: Page for chat was created
ru_ru: Страница чата была создана

source: Page for chat is already exists
ru_ru: Страница чата уже существует

source: Go to chat page
ru_ru: Перейти на страницу чата

source: CommFort users online
ru_ru: Онлайн пользователи CommFort

source: Users online
ru_ru: Пользователей онлайн

source: You are not authorized to view and post messages in chat.
ru_ru: У Вас недостаточно прав для просмотра и отправки сообщений в чат.

source: User from web
ru_ru: Пользователь с веба

source: Insert nick in the posting input
ru_ru: Вставить ник в поле сообщения

source: Show / Hide smilies in this tab
ru_ru: Показать / Скрыть смайлы этой вкладки

source: Smile
ru_ru: Смайл

source: Open link in new window
ru_ru: Открыть ссылку в новом окне

source: User has inserted an image, images are not supported
ru_ru: Пользователь вставил изображение, просмотр изображений не поддерживается

source: User !user_name
ru_ru: Пользователь !user_name

source: You are not registred in chat
ru_ru: Вы не зарегистрированы в чате

source: Already in chat
ru_ru: Уже в чате

source: Waiting for authorization..
ru_ru: Ожидание авторизации...

source: You are not logged in on sait
ru_ru: Вы не зарегистрированы на сайте

source: Too much users online
ru_ru: Превышено максимальное количество пользователей

source: Nick is out of rules
ru_ru: Ник не соответствует требованиям

source: You are banned
ru_ru: Вы забанены

source: Nick includes bad words
ru_ru: Ник содержит слова черного списка

source: Nick is already registred
ru_ru: Такой ник уже зарегистрирован

source: Too much users from IP
ru_ru: Превышено кол-во пользователей с одного IP

source: Activation request sended
ru_ru: Запрос на авторизацию подан

source: Wrong password
ru_ru: Неверный пароль

source: Activation request denied or in progress
ru_ru: Запрос на авторизацию отклонен или на обработке

source: leaved the chat
ru_ru: вышел из чата

source: joined the chat
ru_ru: вошел в чат

source: joined the channel
ru_ru: присоединился к каналу

source: leaved the channel
ru_ru: покинул канал

source: switched to state
ru_ru: переключился в состояние

source: is now online
ru_ru: вернулся в обычное состояние

source: changed sex to
ru_ru: изменил иконку пола на

source: male
ru_ru: мужской

source: female
ru_ru: женский

source: changed channel theme to
ru_ru: изменил тему канала на

source: State
ru_ru: Состояние

source: Click to change state
ru_ru: Изменить состояние

source: Connection to the server is not stable. There may be delays.
ru_ru: Соединение с сервером чата не стабильно. Возможны задержки.

source: Connection to the server is missing. You can communicate only among users from web. Apologies for technical problems.
ru_ru: Соединение с сервером чата отсутствует. Вы можете общаться только между пользователями вебчата. Приносим свои извинения за технические проблемы.

source: view CommFort chat
ru_ru: просматривать чат CommFort

source: send CommFort chat messages
ru_ru: отправлять сообщения в чат CommFort

source: Configure CommFort WebChat settings.
ru_ru: Настройка модуля CommFort WebChat.

source: You must do the initial configuration of the module. Please, visit
ru_ru: Вы должны сделать стартовую настройку модуля. Пожалуйста, перейдите на

source: settings page
ru_ru: страницу настроек

source: WebChat module for CommFort Plugin.
ru_ru: Модуль для плагина CommFort WebChat.

source: Hidden
ru_ru: Скрыт

source: Undefined
ru_ru: Не установлено

source: You write nothing! Please fill text line
ru_ru: Вы ничего не ввели! Пожалуйста, введите текст в поле

source: Your message succesfully sended
ru_ru: Ваше сообщение успешно отправлено

source: The size of the text line must be less then 40000 symbols
ru_ru: Количество букв в текстовом поле должно быть меньше 40000

source: Connection state
ru_ru: Состояние соединения с чатом

source: Channel theme
ru_ru: Тема канала

source: Enable or disable sound notification, when new message in chat recieved
ru_ru: Включить или отключить звуковое оповещение при публикации нового сообщения с веба

source: Sound notification
ru_ru: Звуковое оповещение

source: Enable or disable smilies list autohide, when smile added to message text area
ru_ru: Включить или отключить автоскрытие списка смайлов, после выбора смайла

source: Autohide smilies
ru_ru: Автоскрытие смайлов

source: Show / Hide smilies block
ru_ru: Показать / Скрыть блок смайлов

source: Show / Hide smilies list
ru_ru: Показать / Скрыть список смайлов

source: Show / Hide settings block
ru_ru: Показать / Скрыть настройки

source: Clear chat
ru_ru: Очистить чат

source: Send
ru_ru: Отправить

source: or
ru_ru: или
